<script>
// import HelloWorld from './components/HelloWorld.vue'
import newsСard from "@/components/ui/newsСard.vue";

export default {
  components: {
    newsСard,
  },
  data() {
    return {
      news: [
        {
          title: "Уважаемые коллеги и партнеры!",
          date: "4.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!2",
          date: "3.12.2024",
          minText:
            "Мы рады поделиться новостями о текущих достижениях и планах нашей компании! <br/><br/> 🔹 Рекордные объемы переработки<br/> 🔹 Экологические инициативы<br/>🔹 Расширение мощностей<br/>🔹 Командная работа<br/>🔹 Планы на будущее",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!3",
          date: "2.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText:
            "Мы рады поделиться новостями о текущих достижениях и планах нашей компании! <br/><br/> 🔹 Рекордные объемы переработки<br/> 🔹 Экологические инициативы<br/>🔹 Расширение мощностей<br/>🔹 Командная работа<br/>🔹 Планы на будущее",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
      ],
      currentTime: new Date(),
    };
  },
  mounted() {
    setInterval(() => {
      this.currentTime = new Date();
    }, 1000);
  },
};
</script>

<template>
  <div>
    <h1>Объявления компании</h1>
    <div class="news">
      <ul class="news_list">
        <li v-for="item in news" :key="item.id">
          <newsСard :data1="item" />
        </li>
      </ul>
    </div>
  </div>
</template>

<style scoped>
h1 {
  font-size: 48px;
  color: var(--HeaderСolor);
}
.news {
  margin-top: 35px;
}
.news_list {
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  justify-content: space-evenly;
  gap: 20px;
}
</style>
