<script>
// import HelloWorld from './components/HelloWorld.vue'
import newsСard from "@/components/ui/newsСard.vue";
import axios from "axios";

export default {
  components: {
    newsСard,
  },
  data() {
    return {
      news: [
        {
          title: "Уважаемые коллеги и партнеры!",
          date: "4.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!2",
          date: "4.12.2024",
          minText:
            "Мы рады поделиться новостями о текущих достижениях и планах нашей компании! <br/><br/> 🔹 Рекордные объемы переработки<br/> 🔹 Экологические инициативы<br/>🔹 Расширение мощностей<br/>🔹 Командная работа<br/>🔹 Планы на будущее",
          maxText:
            "Мы рады поделиться новостями о текущих достижениях и планах нашей компании! <br /><br />🔹 Рекордные объемы переработки<br /> На прошлой неделе мы достигли нового максимума по переработке сырья – [количество тонн/баррелей]. Это стало возможным благодаря модернизации оборудования и слаженной работе нашей команды. <br /><br />🔹 Экологические инициативы<br />Продолжается внедрение программы по снижению выбросов: Установлены новые системы очистки воздуха и воды.Внедрены технологии переработки отходов производства.<br /><br />🔹 Расширение мощностей<br />Стартовал второй этап строительства нового перерабатывающего комплекса, который увеличит наши производственныевозможности на [количество]% к [дата завершения проекта]. <br /><br />🔹 Командная работа<br />На прошлой неделе мы провели корпоративный тренинг для сотрудников, посвященный безопасности на производстве.Это часть нашей постоянной программы повышения квалификации и заботы о благополучии команды. <br /><br />🔹Планы на будущее <br />В ближайшее время мы запускаем производство нового типа топлива [название], котороестанет еще более энергоэффективным и экологически чистым. <br /><br />Спасибо за ваш вклад и поддержку! Вместемы движемся вперед к новым достижениям.<br /><br />С уважением, Михаил",
        },
        {
          title: "Уважаемые коллеги и партнеры!3",
          date: "2.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText:
            "Мы рады поделиться новостями о текущих достижениях и планах нашей компании! <br/><br/> 🔹 Рекордные объемы переработки<br/> 🔹 Экологические инициативы<br/>🔹 Расширение мощностей<br/>🔹 Командная работа<br/>🔹 Планы на будущее",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
        {
          title: "Уважаемые коллеги и партнеры!4",
          date: "1.12.2024",
          minText: "Описание",
          maxText: "Описание",
        },
      ],
      currentTime: new Date(),
    };
  },
  created() {},
<<<<<<< HEAD
=======
  mounted() {
    setInterval(() => {
      this.currentTime = new Date();
    }, 1000);
  },
>>>>>>> 11b46e5 ([Server + Date])
};
</script>

<template>
  <div>
    <h1>Объявления компании</h1>
    <div class="news">
      <ul class="news_list">
        <li v-for="item in news" :key="item.id">
          <newsСard :dataItem="item" />
        </li>
      </ul>
    </div>
  </div>
</template>

<style scoped>
h1 {
  font-size: 48px;
  color: var(--HeaderСolor);
}
.news {
  margin-top: 35px;
}
.news_list {
  display: flex;
  flex-direction: row;
  flex-wrap: wrap;
  justify-content: center;
  gap: 20px;
  padding: 2px;
}
</style>
